**free

dcl-s variable1 char(10) inz('hola');
dcl-s variable2 char(10) inz('hola1');
dcl-s variable3 char(10) inz('hola2');

dsply variable2;
dsply variable3;

*inlr = *on;
return;

